import requests

url = "http://0.0.0.0:8000/model"

res = requests.post(
    url, json={"x": ["Москва – столица России, многонациональный город на Москве-реке в западной части страны."]}
)
print(res.json())

"""
Output:

{'entity_substr': [['Москва', 'России', 'Москве-реке', 'западной части']],  # извлеченные сущности
 'entity_offsets': [[[0, 6], [17, 23], [52, 63], [66, 80]]],                # индексы в тексте первого и последнего символа подстрок с сущностями
 'entity_positions': [[[0], [3], [8, 9, 10], [12, 13]]],                    # индексы в тексте токенов сущностей
 'tags': [['CITY', 'COUNTRY', 'LOCATION', 'LOCATION']],                     # теги сущностей
 'sentences_offsets': [[[0, 88]]],                                          # индексы в тексте первого и последнего символа предложений текста
 'sentences': [['Москва – столица России, многонациональный город на Москве-реке в западной части страны.']],  # предложения текста
 'probas': [[0.9742, 0.9997, 0.6969, 0.9666]]}                              # вероятности (confidences) извлеченных сущностей

"""
